tap "arl/arl"
tap "bufbuild/buf"
tap "caarlos0/tap"
tap "danvergara/tools"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "ktr0731/evans"
tap "kyoh86/tap"
tap "romkatv/powerlevel10k"
tap "snyk/tap"
tap "uw-labs/tap"
brew "python@3.11"
brew "awscli"
brew "awscli@1"
brew "bash"
brew "bat"
brew "gcc"
brew "btop"
brew "certbot"
brew "cmake"
brew "cocoapods"
brew "colima"
brew "curl"
brew "tidy-html5"
brew "composer"
brew "coreutils"
brew "node"
brew "czg"
brew "dnsmasq"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "exa"
brew "findutils"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "glow"
brew "gnu-sed"
brew "go"
brew "golangci-lint"
brew "netpbm"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "hey"
brew "httpd"
brew "jq"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "mage"
brew "moreutils"
brew "mysql@5.7"
brew "neofetch"
brew "tree-sitter"
brew "neovim", args: ["HEAD"]
brew "ninja"
brew "nvm"
brew "openjdk@11", link: true
brew "pipenv"
brew "powerlevel10k"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust"
brew "rustup-init"
brew "stow"
brew "stylua"
brew "telnet"
brew "terminal-notifier"
brew "tflint"
brew "tig"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "vim"
brew "wakatime-cli"
brew "watchman"
brew "wget"
brew "yarn"
brew "zoxide"
brew "zsh"
brew "arl/arl/gitmux"
brew "bufbuild/buf/buf"
brew "caarlos0/tap/timer"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "ktr0731/evans/evans"
brew "kyoh86/tap/richgo"
brew "snyk/tap/snyk"
brew "uw-labs/tap/strongbox"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "appcleaner"
cask "arc"
cask "bartender"
cask "brave-browser"
cask "element"
cask "epic-games"
cask "firefox"
cask "font-codicon"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-for-powerline"
cask "font-meslo-lg-dz"
cask "font-meslo-lg-nerd-font"
cask "font-noto-color-emoji"
cask "google-chrome"
cask "gpg-suite"
cask "insomnia"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keepingyouawake"
cask "meetingbar"
cask "moom"
cask "nordvpn"
cask "obsidian"
cask "postman"
cask "rambox"
cask "sequel-ace"
cask "shift"
cask "slack"
cask "spaceman"
cask "spotify"
cask "stats"
cask "utm"
cask "visual-studio-code-insiders"
cask "zoom"
