tap "arl/arl"
tap "atomicjar/tap"
tap "bufbuild/buf"
tap "caarlos0/tap"
tap "danvergara/tools"
tap "felixkratz/formulae"
tap "gambithunt/tools"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "joshmedeski/sesh"
tap "koekeishiya/formulae"
tap "ktr0731/evans"
tap "kyoh86/tap"
tap "mat2cc/tap"
tap "nikitabobko/tap"
tap "romkatv/powerlevel10k"
tap "snyk/tap"
tap "teamookla/speedtest"
tap "uw-labs/tap"
tap "vladimirvivien/oss-tools"
brew "awscli"
brew "awscli@1"
brew "bash"
brew "bat"
brew "bob"
brew "btop"
brew "certbot"
brew "cmake"
brew "cocoapods"
brew "colima"
brew "curl"
brew "tidy-html5"
brew "composer"
brew "coreutils"
brew "node"
brew "czg"
brew "direnv"
brew "dnsmasq"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "entr"
brew "eza"
brew "fastfetch"
brew "fd"
brew "harfbuzz"
brew "pango"
brew "ffmpegthumbnailer"
brew "figlet"
brew "findutils"
brew "fish"
brew "fx"
brew "fzf"
brew "gcc"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "gnu-sed"
brew "go"
brew "golangci-lint"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "gum"
brew "httpd"
brew "imagemagick"
brew "jless"
brew "jq"
brew "julia"
brew "k9s"
brew "kind"
brew "kubeconform"
brew "kubernetes-cli"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "libsixel"
brew "lpeg"
brew "lua"
brew "luarocks"
brew "moreutils"
brew "ninja"
brew "nowplaying-cli"
brew "nvm"
brew "openjdk@11", link: true
brew "pipenv"
brew "pkgconf"
brew "poppler"
brew "powerlevel10k"
brew "pre-commit"
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "scdoc"
brew "tree-sitter"
brew "semgrep"
brew "shellcheck"
brew "starship"
brew "stow"
brew "stylua"
brew "switchaudio-osx"
brew "telnet"
brew "terminal-notifier"
brew "tflint"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "unar"
brew "vim"
brew "wakatime-cli"
brew "watchman"
brew "wget"
brew "xh"
brew "yarn"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh"
brew "arl/arl/gitmux"
brew "bufbuild/buf/buf"
brew "caarlos0/tap/timer"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "gambithunt/tools/ghostty-ghost"
brew "goreleaser/tap/goreleaser"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"
brew "joshmedeski/sesh/sesh"
brew "ktr0731/evans/evans"
brew "kyoh86/tap/richgo"
brew "snyk/tap/snyk"
brew "teamookla/speedtest/speedtest"
brew "uw-labs/tap/strongbox"
brew "vladimirvivien/oss-tools/ktop"
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "alacritty"
cask "appcleaner"
cask "arc"
cask "brave-browser"
cask "epic-games"
cask "firefox"
cask "font-codicon"
cask "font-commit-mono"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-for-powerline"
cask "font-meslo-lg-dz"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
cask "font-noto-color-emoji"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "gpg-suite"
cask "insomnia"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keepingyouawake"
cask "kitty"
cask "meetingbar"
cask "obsidian"
cask "ollama"
cask "postman"
cask "rambox"
cask "raycast"
cask "sequel-ace"
cask "sf-symbols"
cask "shortcat"
cask "slack"
cask "spotify"
cask "stats"
cask "tomatobar"
cask "ubersicht"
cask "utm"
cask "visual-studio-code@insiders"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "zoom"
